import '../Model/NewsModels.dart';

List<NewsModels> news = [
NewsModels(
  headName: 'Плановые работы по ремонту лифта',
  text: 'Уважаемые жильцы! Сообщаем вам о проведении плановых работ по ремонту лифта в нашем доме. Работы начнутся с 10 декабря и будут проводиться в течение недели. Просим прощения за возможные неудобства.',
  image: 'https://prlift.ru/wp-content/uploads/2020/09/remont-lift.jpg',
  isImage: true),
NewsModels(
  headName: 'Новогодний украшенный двор',
  text: 'Дорогие соседи! В преддверии Нового Года мы планируем устроить украшение нашего двора. Приглашаем всех жильцов присоединиться и предложить свои идеи для создания уютной новогодней атмосферы.',
  image: 'https://sun9-52.userapi.com/impg/FHG0l2-sM6ij2q4QtjBTNvzGeG-LdHVWZH2Ohg/5byPKv_VJDQ.jpg?size=1024x1023&quality=96&sign=9a5a7d06391e25c90b32f5c2071f033a&type=album',
  isImage: true),
NewsModels(
  headName: 'Обновление системы видеонаблюдения',
  text: 'В целях улучшения безопасности в нашем доме мы проведем обновление системы видеонаблюдения. Работы запланированы на ближайшие выходные. Пожалуйста, будьте готовы к кратковременным перерывам в подаче электроэнергии.',
  image: 'https://software-expert.ru/wp-content/uploads/2023/09/government-surveillance-scaled.webp',
  isImage: true),
NewsModels(
  headName: 'Сбор предложений по благоустройству двора',
  text: 'Жильцы нашего дома приглашаются предложить идеи по благоустройству дворовой территории. Мы создали онлайн-опрос, чтобы каждый мог высказать свое мнение. Ссылка на опрос размещена в нашей группе в социальных сетях.',
  image: 'https://sun9-51.userapi.com/impg/_4qBiNLPQiMqEqUSga090QsF93rB1d0jpx264A/UZ8yfzU47G4.jpg?size=850x601&quality=96&sign=faae7f48fa93bec493e70a776dca1fbc&type=album',
  isImage: true),
NewsModels(
  headName: 'Информация о мероприятиях по обслуживанию канализации',
  text: 'Уважаемые жильцы! Предупреждаем вас о проведении регулярных мероприятий по техническому обслуживанию канализационной системы. Во избежание проблем рекомендуем соблюдать осторожность при использовании сантехнических приборов.',
  image: '',
  isImage: false),
NewsModels(
  headName: 'Изменение графика вывоза мусора',
  text: 'Обращаем ваше внимание на изменение графика вывоза мусора в связи с предстоящими новогодними праздниками. Прошу всех соблюдать новый график и не выносить мусор на улицу в неположенное время.',
  image: 'https://cdn.ramnews.ru/wp-content/uploads/2015/08/-------------------------2.jpg',
  isImage: true),
NewsModels(
  headName: 'Акция по экономии электроэнергии',
  text: 'Мы приглашаем вас принять участие в акции по экономии электроэнергии. В течение месяца те, кто сэкономит больше всего, получат призы от управляющей компании. Давайте вместе сделаем наше дом энергоэффективным!',
  image: 'https://sc-11.uogr.ru/views/sc-11.uogr.ru/img/articles/fullsize/65.jpg',
  isImage: true),
NewsModels(
  headName: 'Изменения в работе парковочных мест',
  text: 'В связи с ремонтными работами на парковочных местах возможны временные изменения в доступности парковки. Мы приносим извинения за возможные неудобства и просим вас соблюдать указания персонала.',
  image: 'https://sun9-50.userapi.com/impg/vVBymH0mjD3O_aOD8xK5rrwNDbhMpkqaL_MA2g/hpGLeGL59MA.jpg?size=670x669&quality=95&sign=0f4c7f41b2e9ad7c81fe591b98a22079&c_uniq_tag=DVtE_22NLX2yybiPj2bxK1f6wwAZYqeiLTisGSpRYHQ&type=album',
  isImage: true),
NewsModels(
  headName: 'Расширение детской игровой зоны',
  text: 'Для наших маленьких жильцов мы планируем расширить детскую игровую зону во дворе. Поделитесь своими предложениями и идеями по улучшению места для игр детей.',
  image: 'https://cdn.vashgorod.ru/r/1200x1000/news/48/fa/48fa5e6b07fbce8e54eb821aca630cf2.jpg',
  isImage: true),
NewsModels(
  headName: 'Плановые работы по обслуживанию газового оборудования',
  text: 'Сообщаем вам о предстоящих плановых работах по обслуживанию газового оборудования. Работы будут проводиться с 8 по 15 января. В это время возможны кратковременные перерывы в газоснабжении. Просим вас быть бдительными.',
  image: 'https://odstroy.ru/wp-content/uploads/f/3/8/f38a51aabf5bdd3c50265d5a80c4c86e.jpeg',
  isImage: true),
NewsModels(
  headName: 'Оповещение о проверке противопожарного оборудования',
  text: 'В целях обеспечения безопасности жильцов мы проведем проверку противопожарного оборудования. Ваша безопасность - наш приоритет. Просим вас сотрудничать и предоставить доступ для проведения проверки.',
  image: '',
  isImage: false),
NewsModels(
  headName: 'Обновление внутридомовой сети интернета',
  text: 'Уважаемые соседи! В ближайшее время мы проведем обновление внутридомовой сети интернета. Новое оборудование поможет улучшить скорость и качество интернет-соединения. Благодарим за ваше понимание.',
  image: 'https://overclockers.ru/st/legacy/blog/213212/169041_O.jpg',
  isImage: true),
];